news-reader/app/controllers/api/feeds_controller.rb

  def show
    render :json => Feed.find(params[:id]).to_json(include: :latest_entries)
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]